Тест_ЗУП_31_КОРП/src/Enums/ТипыАттестацииСотрудников/ТипыАттестацииСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыАттестацииСотрудников</name>
  <enumValues>
    <name>ПодтверждениеСоответствияДолжности</name>
  </enumValues>
  <enumValues>
    <name>ПодтверждениеКвалификацииПоСпециальности</name>
  </enumValues>
</mdclass:Enum>

Тест_ЗУП_31_КОРП/src/Enums/РезультатыАттестацииНаСоответствиеДолжности/РезультатыАттестацииНаСоответствиеДолжности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>РезультатыАттестацииНаСоответствиеДолжности</name>
  <enumValues>
    <name>НеСоответствуетЗамещаемойДолжности</name>
  </enumValues>
  <enumValues>
    <name>СоответствуетЗамещаемойДолжности</name>
  </enumValues>
</mdclass:Enum>

Тест_ЗУП_31_КОРП/src/Enums/РезультатыПодтвержденияКвалификацииПоСпециальности/РезультатыПодтвержденияКвалификацииПоСпециальности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>РезультатыПодтвержденияКвалификацииПоСпециальности</name>
  <enumValues>
    <name>КвалификацияПодтверждена</name>
  </enumValues>
  <enumValues>
    <name>КвалификацияНеПодтверждена</name>
  </enumValues>
</mdclass:Enum>

Тест_ЗУП_31_КОРП/src/CommonModules/АттестацииСотрудниковФормы/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

Функция ДоступныеРезультатыАттестации(ВидАттестации) Экспорт 
	
	ДоступныеРезультаты = Новый Массив;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ГосударственнаяСлужба") 
		И АттестацииСотрудников.ЭтоАттестацияГосударственныхСлужащих(ВидАттестации) Тогда
		
		Модуль = ОбщегоНазначения.ОбщийМодуль("ГосударственнаяСлужба");
		ДоступныеРезультаты = Модуль.ДоступныеРезультатыАттестацииГосударственныхСлужащих();		
		
	Иначе		
		
		ТипАттестации = АттестацииСотрудников.ТипАттестации(ВидАттестации);
		Если ТипАттестации = Перечисления.ТипыАттестацииСотрудников.ПодтверждениеСоответствияДолжности Тогда 
			ДоступныеРезультаты.Добавить(Перечисления.РезультатыАттестацииНаСоответствиеДолжности.СоответствуетЗамещаемойДолжности);
			ДоступныеРезультаты.Добавить(Перечисления.РезультатыАттестацииНаСоответствиеДолжности.НеСоответствуетЗамещаемойДолжности);
		Иначе 	
			ДоступныеРезультаты.Добавить(Перечисления.РезультатыПодтвержденияКвалификацииПоСпециальности.КвалификацияПодтверждена);
			ДоступныеРезультаты.Добавить(Перечисления.РезультатыПодтвержденияКвалификацииПоСпециальности.КвалификацияНеПодтверждена);
		КонецЕсли;
		
	КонецЕсли; 
	
	Возврат ДоступныеРезультаты;
	
КонецФункции

Функция ПоложительныйРезультатАттестации(ВидАттестации) Экспорт 
	
	ПоложительныйРезультатАттестации = Неопределено;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ГосударственнаяСлужба") 
		И АттестацииСотрудников.ЭтоАттестацияГосударственныхСлужащих(ВидАттестации) Тогда
		
		Модуль = ОбщегоНазначения.ОбщийМодуль("ГосударственнаяСлужба");
		ПоложительныйРезультатАттестации = Модуль.ПоложительныйРезультатАттестации();		
		
	Иначе		
		
		ТипАттестации = АттестацииСотрудников.ТипАттестации(ВидАттестации);
		Если ТипАттестации = Перечисления.ТипыАттестацииСотрудников.ПодтверждениеСоответствияДолжности Тогда 
			ПоложительныйРезультатАттестации = Перечисления.РезультатыАттестацииНаСоответствиеДолжности.СоответствуетЗамещаемойДолжности;
		Иначе 	
			ПоложительныйРезультатАттестации = Перечисления.РезультатыПодтвержденияКвалификацииПоСпециальности.КвалификацияПодтверждена;
		КонецЕсли;
		
	КонецЕсли; 
	
	Возврат ПоложительныйРезультатАттестации;
	
КонецФункции

Функция ДлительностьАттестационнойКампанииГод(ВидАттестации) Экспорт
	
	ДлительностьАттестационнойКампанииГод = АттестацииСотрудников.ЭтоАттестацияГосударственныхСлужащих(ВидАттестации);	
	
	Возврат ДлительностьАттестационнойКампанииГод;
	
КонецФункции

Функция РедактироватьВидАктаУтверждающегоКомиссию(ВидАттестации) Экспорт
	
	РедактироватьВидАктаУтверждающегоКомиссию = АттестацииСотрудников.ЭтоАттестацияГосударственныхСлужащих(ВидАттестации);	
	
	Возврат РедактироватьВидАктаУтверждающегоКомиссию;
	
КонецФункции

Функция ПродолжительностьАттестацииОдногоСотрудникаПоУмолчанию() Экспорт
	КоличествоМинутНаПроведениеАттестацииОдногоСотрудника = 30;
	Возврат КоличествоМинутНаПроведениеАттестацииОдногоСотрудника;
КонецФункции

Функция НеобходимоОтображатьДатуВнеочереднойАттестации(ВидАттестации) Экспорт
	
	Отображать = Истина;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ГосударственнаяСлужба") 
		И АттестацииСотрудников.ЭтоАттестацияГосударственныхСлужащих(ВидАттестации) Тогда
		Модуль = ОбщегоНазначения.ОбщийМодуль("ГосударственнаяСлужба");
		Отображать = Модуль.НеобходимоОтображатьДатуВнеочереднойАттестации(ВидАттестации);		
	Иначе		
		Отображать = АттестацииСотрудников.ЭтоВнешняяАттестация(ВидАттестации);
	КонецЕсли; 
	
	Возврат Отображать;
	
КонецФункции

#КонецОбласти
